src/cf/Catalogs/узСпринты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>узСпринты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпринтЗавершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветСпринта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧЗадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.узЗадачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/узСпринты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТЧЗадачи.Параметры.УстановитьЗначениеПараметра("Спринт",Объект.Ссылка);
	ТЧЗадачи.Параметры.УстановитьЗначениеПараметра("ЭтоНовый",Объект.Ссылка.Пустая());
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	Элементы.Наименование.ТолькоПросмотр = Истина;
	Элементы.ДатаНачала.ТолькоПросмотр = Истина;
	Элементы.ДатаОкончания.ТолькоПросмотр = Истина;
	Элементы.ТЧЗадачи.ТолькоПросмотр = Истина;	
	Если НЕ Объект.СпринтЗавершен Тогда
		Элементы.Наименование.ТолькоПросмотр = Ложь;
		Элементы.ДатаНачала.ТолькоПросмотр = Ложь;
		Элементы.ДатаОкончания.ТолькоПросмотр = Ложь;
		Элементы.ТЧЗадачи.ТолькоПросмотр = Ложь;		
	Конецесли;
КонецПроцедуры 

&НаКлиенте
Процедура СпринтЗавершенПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	Элементы.ТЧЗадачи.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ЦветСпринта = Новый ХранилищеЗначения(ЦветСпринтаНаФорме);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЦветСпринтаНаФорме = ТекущийОбъект.ЦветСпринта.Получить();
КонецПроцедуры
